/*
Абстракция - в объектно-ориентированном программировании это придание объекту характеристик которые отличают
его от всех объектов четко определяя его концептуальные границы.
Основная идея состоит в том, чтобы отделить способ использования составных объектов данных от деталей
их реализации в виде более простых объектов подобно тому, как функциональная абстракция разделяет способ
использования функции и деталей ее реализации в терминах более примитивных функций, таким образом, данные обрабатываются
функцией высокого уровня с помощью вызова функций низкого уровня.
 */

